// afting.c
#include "room.h"
inherit ROOM;

void create()
{
        set("short", "¸ôÓêºìÂ¥");
        set("long", @LONG
[1;31m ºìÂ¥¸ôÓêÏàÍûÀä£¬Öé²­Æ®µÆ¶À×Ô¹é¡£[2;37;0m
[31m ¡¡¡¡ÓÆÑï¹éÃÎÎ©µÆ¼û£¬CÂäÉúÑÄ¶À¾ÆÖª¡£[2;37;0m
¡¡¡¡Ò»½ÇºìÇ½£¬ÎİÒĞÉ½±Ú£¬Î÷ÃæÇ½ÉÏ¿ªÒ»ÉÈĞù´°£¬Õı¶ÔÄıÓêÍ¤¡£´°
ÏÂ¼¸İıĞåÇò»¨£¬»¨ÆÚÎ´µ½£¬Ö¦Ò¶¹Ë×Ôµ¥±¡¡£ÊÒÄÚÒ»½Çµ¥´²£¬Ò»ÄêËÄ
¼¾¶¼ÆÌ×ÅÖñÏ¯Á¹ô¡¡£Õí±ß¼¸°¸£¬°Ú×ÅÊı²áÊ«³­£¬Ò»µÆÈç¶¹¡£´°±ßÇÙ
°¸£¬ÇÙÉÏËæÒâ¸²×ÅÒ»¼ş³¤Éí¶·Åñ¡£
LONG );
        set("exits", ([
                "out"   : "/d/hangzhou/chashi.c",
        ]));
        
        set("sleep_room", "1");
	 set("no_fight", "1");
//      set("no_clean_up", 0);

        setup();
        replace_program(ROOM);
}

